reports/aws_1ing_5inst_500batch_10user.log

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: tunnels.js
     output: -

  scenarios: (100.00%) 1 scenario, 10 max VUs, 1m30s max duration (incl. graceful stop):
           * thousand-vus: 10 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
thousand-vus   [   2% ] 10 VUs  0m01.0s/1m0s

running (0m02.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
thousand-vus   [   3% ] 10 VUs  0m02.0s/1m0s

running (0m03.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
thousand-vus   [   5% ] 10 VUs  0m03.0s/1m0s

running (0m04.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
thousand-vus   [   7% ] 10 VUs  0m04.0s/1m0s

running (0m05.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
thousand-vus   [   8% ] 10 VUs  0m05.0s/1m0s

running (0m06.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
thousand-vus   [  10% ] 10 VUs  0m06.0s/1m0s

running (0m07.0s), 10/10 VUs, 48 complete and 0 interrupted iterations
thousand-vus   [  12% ] 10 VUs  0m07.0s/1m0s

running (0m08.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
thousand-vus   [  13% ] 10 VUs  0m08.0s/1m0s

running (0m09.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
thousand-vus   [  15% ] 10 VUs  0m09.0s/1m0s

running (0m10.0s), 10/10 VUs, 70 complete and 0 interrupted iterations
thousand-vus   [  17% ] 10 VUs  0m10.0s/1m0s

running (0m11.0s), 10/10 VUs, 80 complete and 0 interrupted iterations
thousand-vus   [  18% ] 10 VUs  0m11.0s/1m0s

running (0m12.0s), 10/10 VUs, 90 complete and 0 interrupted iterations
thousand-vus   [  20% ] 10 VUs  0m12.0s/1m0s

running (0m13.0s), 10/10 VUs, 100 complete and 0 interrupted iterations
thousand-vus   [  22% ] 10 VUs  0m13.0s/1m0s

running (0m14.0s), 10/10 VUs, 110 complete and 0 interrupted iterations
thousand-vus   [  23% ] 10 VUs  0m14.0s/1m0s

running (0m15.0s), 10/10 VUs, 110 complete and 0 interrupted iterations
thousand-vus   [  25% ] 10 VUs  0m15.0s/1m0s

running (0m16.0s), 10/10 VUs, 120 complete and 0 interrupted iterations
thousand-vus   [  27% ] 10 VUs  0m16.0s/1m0s

running (0m17.0s), 10/10 VUs, 130 complete and 0 interrupted iterations
thousand-vus   [  28% ] 10 VUs  0m17.0s/1m0s

running (0m18.0s), 10/10 VUs, 140 complete and 0 interrupted iterations
thousand-vus   [  30% ] 10 VUs  0m18.0s/1m0s

running (0m19.0s), 10/10 VUs, 150 complete and 0 interrupted iterations
thousand-vus   [  32% ] 10 VUs  0m19.0s/1m0s

running (0m20.0s), 10/10 VUs, 160 complete and 0 interrupted iterations
thousand-vus   [  33% ] 10 VUs  0m20.0s/1m0s

running (0m21.0s), 10/10 VUs, 170 complete and 0 interrupted iterations
thousand-vus   [  35% ] 10 VUs  0m21.0s/1m0s

running (0m22.0s), 10/10 VUs, 180 complete and 0 interrupted iterations
thousand-vus   [  37% ] 10 VUs  0m22.0s/1m0s

running (0m23.0s), 10/10 VUs, 185 complete and 0 interrupted iterations
thousand-vus   [  38% ] 10 VUs  0m23.0s/1m0s

running (0m24.0s), 10/10 VUs, 190 complete and 0 interrupted iterations
thousand-vus   [  40% ] 10 VUs  0m24.0s/1m0s

running (0m25.0s), 10/10 VUs, 200 complete and 0 interrupted iterations
thousand-vus   [  42% ] 10 VUs  0m25.0s/1m0s

running (0m26.0s), 10/10 VUs, 210 complete and 0 interrupted iterations
thousand-vus   [  43% ] 10 VUs  0m26.0s/1m0s

running (0m27.0s), 10/10 VUs, 220 complete and 0 interrupted iterations
thousand-vus   [  45% ] 10 VUs  0m27.0s/1m0s

running (0m28.0s), 10/10 VUs, 230 complete and 0 interrupted iterations
thousand-vus   [  47% ] 10 VUs  0m28.0s/1m0s

running (0m29.0s), 10/10 VUs, 240 complete and 0 interrupted iterations
thousand-vus   [  48% ] 10 VUs  0m29.0s/1m0s

running (0m30.0s), 10/10 VUs, 250 complete and 0 interrupted iterations
thousand-vus   [  50% ] 10 VUs  0m30.0s/1m0s

running (0m31.0s), 10/10 VUs, 256 complete and 0 interrupted iterations
thousand-vus   [  52% ] 10 VUs  0m31.0s/1m0s

running (0m32.0s), 10/10 VUs, 265 complete and 0 interrupted iterations
thousand-vus   [  53% ] 10 VUs  0m32.0s/1m0s

running (0m33.0s), 10/10 VUs, 270 complete and 0 interrupted iterations
thousand-vus   [  55% ] 10 VUs  0m33.0s/1m0s

running (0m34.0s), 10/10 VUs, 280 complete and 0 interrupted iterations
thousand-vus   [  57% ] 10 VUs  0m34.0s/1m0s

running (0m35.0s), 10/10 VUs, 290 complete and 0 interrupted iterations
thousand-vus   [  58% ] 10 VUs  0m35.0s/1m0s

running (0m36.0s), 10/10 VUs, 300 complete and 0 interrupted iterations
thousand-vus   [  60% ] 10 VUs  0m36.0s/1m0s

running (0m37.0s), 10/10 VUs, 310 complete and 0 interrupted iterations
thousand-vus   [  62% ] 10 VUs  0m37.0s/1m0s

running (0m38.0s), 10/10 VUs, 320 complete and 0 interrupted iterations
thousand-vus   [  63% ] 10 VUs  0m38.0s/1m0s

running (0m39.0s), 10/10 VUs, 330 complete and 0 interrupted iterations
thousand-vus   [  65% ] 10 VUs  0m39.0s/1m0s

running (0m40.0s), 10/10 VUs, 336 complete and 0 interrupted iterations
thousand-vus   [  67% ] 10 VUs  0m40.0s/1m0s

running (0m41.0s), 10/10 VUs, 345 complete and 0 interrupted iterations
thousand-vus   [  68% ] 10 VUs  0m41.0s/1m0s

running (0m42.0s), 10/10 VUs, 350 complete and 0 interrupted iterations
thousand-vus   [  70% ] 10 VUs  0m42.0s/1m0s

running (0m43.0s), 10/10 VUs, 360 complete and 0 interrupted iterations
thousand-vus   [  72% ] 10 VUs  0m43.0s/1m0s

running (0m44.0s), 10/10 VUs, 370 complete and 0 interrupted iterations
thousand-vus   [  73% ] 10 VUs  0m44.0s/1m0s

running (0m45.0s), 10/10 VUs, 376 complete and 0 interrupted iterations
thousand-vus   [  75% ] 10 VUs  0m45.0s/1m0s

running (0m46.0s), 10/10 VUs, 386 complete and 0 interrupted iterations
thousand-vus   [  77% ] 10 VUs  0m46.0s/1m0s

running (0m47.0s), 10/10 VUs, 395 complete and 0 interrupted iterations
thousand-vus   [  78% ] 10 VUs  0m47.0s/1m0s

running (0m48.0s), 10/10 VUs, 400 complete and 0 interrupted iterations
thousand-vus   [  80% ] 10 VUs  0m48.0s/1m0s

running (0m49.0s), 10/10 VUs, 410 complete and 0 interrupted iterations
thousand-vus   [  82% ] 10 VUs  0m49.0s/1m0s

running (0m50.0s), 10/10 VUs, 420 complete and 0 interrupted iterations
thousand-vus   [  83% ] 10 VUs  0m50.0s/1m0s

running (0m51.0s), 10/10 VUs, 426 complete and 0 interrupted iterations
thousand-vus   [  85% ] 10 VUs  0m51.0s/1m0s

running (0m52.0s), 10/10 VUs, 436 complete and 0 interrupted iterations
thousand-vus   [  87% ] 10 VUs  0m52.0s/1m0s

running (0m53.0s), 10/10 VUs, 445 complete and 0 interrupted iterations
thousand-vus   [  88% ] 10 VUs  0m53.0s/1m0s

running (0m54.0s), 10/10 VUs, 450 complete and 0 interrupted iterations
thousand-vus   [  90% ] 10 VUs  0m54.0s/1m0s

running (0m55.0s), 10/10 VUs, 460 complete and 0 interrupted iterations
thousand-vus   [  92% ] 10 VUs  0m55.0s/1m0s

running (0m56.0s), 10/10 VUs, 466 complete and 0 interrupted iterations
thousand-vus   [  93% ] 10 VUs  0m56.0s/1m0s

running (0m57.0s), 10/10 VUs, 476 complete and 0 interrupted iterations
thousand-vus   [  95% ] 10 VUs  0m57.0s/1m0s

running (0m58.0s), 10/10 VUs, 486 complete and 0 interrupted iterations
thousand-vus   [  97% ] 10 VUs  0m58.0s/1m0s

running (0m59.0s), 10/10 VUs, 495 complete and 0 interrupted iterations
thousand-vus   [  98% ] 10 VUs  0m59.0s/1m0s

running (1m00.0s), 10/10 VUs, 500 complete and 0 interrupted iterations
thousand-vus   [ 100% ] 10 VUs  1m00.0s/1m0s

running (1m00.9s), 00/10 VUs, 510 complete and 0 interrupted iterations
thousand-vus ✓ [ 100% ] 10 VUs  1m0s

     ✓ status is 200

     checks.........................: 100.00% ✓ 510      ✗ 0   
     data_received..................: 481 kB  7.9 kB/s
     data_sent......................: 158 kB  2.6 kB/s
     http_req_blocked...............: avg=12.63ms  min=1.38µs   med=7.35µs   max=660.26ms p(90)=11.09µs  p(95)=12.7µs  
     http_req_connecting............: avg=3.93ms   min=0s       med=0s       max=201.2ms  p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=170.1ms  min=119.51ms med=138.23ms max=421.28ms p(90)=230.15ms p(95)=247.55ms
       { expected_response:true }...: avg=170.1ms  min=119.51ms med=138.23ms max=421.28ms p(90)=230.15ms p(95)=247.55ms
     http_req_failed................: 0.00%   ✓ 0        ✗ 510 
     http_req_receiving.............: avg=91.88µs  min=21.98µs  med=88.03µs  max=282.98µs p(90)=140.28µs p(95)=158.08µs
     http_req_sending...............: avg=52.09µs  min=8.85µs   med=48.42µs  max=286.29µs p(90)=81.16µs  p(95)=104.4µs 
     http_req_tls_handshaking.......: avg=8.03ms   min=0s       med=0s       max=425.46ms p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=169.95ms min=119.37ms med=138.09ms max=421.12ms p(90)=230.01ms p(95)=247.45ms
     http_reqs......................: 510     8.375884/s
     iteration_duration.............: avg=1.18s    min=1.12s    med=1.14s    max=1.85s    p(90)=1.24s    p(95)=1.28s   
     iterations.....................: 510     8.375884/s
     vus............................: 10      min=10     max=10
     vus_max........................: 10      min=10     max=10